In [17]:
# Task 3: Use .seek() to Re-read Data
# Create a StringIO object containing 
# CSV data, read it into pandas, then 
# reset the cursor with .seek(0) and 
# read it again into another DataFrame.
# Verify both DataFrames are identical.

import pandas as pd
from io import StringIO

data = """Name,Age,Address,CGPA,Contact\n
          Fawad,19,Mardan,3.05,3445755845\n
          Hamza,20,Bajour,3.08,3229596970\n
          Misbah,22,Swat,3.00,3322345894\n
          Abid,23,Kurram,3.50,3215566789\n"""

csv_data = StringIO(data)
csv_data
df1 = pd.read_csv(csv_data)
df1

               Name  Age Address  CGPA     Contact
0             Fawad   19  Mardan  3.05  3445755845
1             Hamza   20  Bajour  3.08  3229596970
2            Misbah   22    Swat  3.00  3322345894
3              Abid   23  Kurram  3.50  3215566789

In [18]:
csv_data.seek(0)

0

In [19]:
df2 = pd.DataFrame(df)
df2

               Name  Age Address  CGPA     Contact
0             Fawad   19  Mardan  3.05  3445755845
1             Hamza   20  Bajour  3.08  3229596970
2            Misbah   22    Swat  3.00  3322345894
3              Abid   23  Kurram  3.50  3215566789

In [20]:
are_identical1 = df1.equals(df2) 
print("Is the above data :" , are_identical1)

Is the above data : True